БИТУправление_медицинским_центром_демо/src/Catalogs/КлассификаторыМинЗдрава/КлассификаторыМинЗдрава.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторыМинЗдрава</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлассификатора</name>
    <type>
      <types>EnumRef.ВидыКлассификаторовМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>НПП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/КлассификаторыМинЗдрава/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Перем ИдентификаторПользовательскойНастройки;
	
	Если ЗначениеЗаполнено(Параметры.ВидКлассификатора) Тогда
		Попытка
			ЭлементОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0];
			ЭлементОтбора.ПравоеЗначение = Параметры.ВидКлассификатора;
			ЭлементОтбора.Использование = Истина;
		Исключение
			РаботаСФормамиКлиент.УстановитьОтборСписка("ВидКлассификатора", Параметры.ВидКлассификатора, Список);
		КонецПопытки;
	КонецЕсли;
	
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагрузкаНСИМинздрава" Тогда
		Элементы.Список.Обновить();
		Сообщить("Загрузка/обновление данных классификатора прошло успешно!");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСправочник(Команда)
	
	ТекущийВидКлассификатора = ТекущийОтборВидКлассификатора(Список.КомпоновщикНастроек);
	Если ЗначениеЗаполнено(ТекущийВидКлассификатора) Тогда
		
		СтруктураПараметры = Новый Структура("НаименованиеСправочника,	 ВидКлассификатора",
											 "КлассификаторыМинЗдрава",	 ТекущийВидКлассификатора);
		
		Оповещение = Новый ОписаниеОповещения("ЗагрузкаКлассификатораЗавершена",ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ЗагрузкаНСИЕГИСЗ", СтруктураПараметры, ЭтотОбъект, ТекущийВидКлассификатора,,,Оповещение);
		
	Иначе
		ОткрытьФорму("Справочник.КлассификаторыМинЗдрава.Форма.ЗагрузкаСправочника");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)

	РаботаСДиалогамиКлиент.ПоместитьВАрхив(Элементы.Список.ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьАрхивные(Команда)

	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ТекущийВидКлассификатора = ТекущийОтборВидКлассификатора(Настройки.Отбор);
	
	Если ЗначениеЗаполнено(ТекущийВидКлассификатора) Тогда
		Для Каждого СтрокаСписка Из Строки Цикл
			Если СтрокаСписка.Значение.Данные.ВидКлассификатора <> ТекущийВидКлассификатора Тогда
				Для Каждого ОформлениеЯчейки Из СтрокаСписка.Значение.Оформление Цикл
					ОформлениеЯчейки.Значение.УстановитьЗначениеПараметра("Видимость", Ложь);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТекущийОтборВидКлассификатора(Знач КомпоновщикНастроек)
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ОтборКомпоновкиСписка  = КомпоновщикНастроек.ПолучитьНастройки().Отбор.Элементы;
	Иначе
		ОтборКомпоновкиСписка = КомпоновщикНастроек.Элементы;	
	КонецЕсли; 
	
	Для Каждого ЭлементОтбора Из ОтборКомпоновкиСписка  Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКлассификатора")
			И ЭлементОтбора.Использование
			И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
		Тогда
			Возврат ЭлементОтбора.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаКлассификатораЗавершена(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список, Элементы.СписокСкрытьПоказатьАрхивные.Пометка);
КонецПроцедуры

#КонецОбласти
